m/crystal/blog/c/game.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-22 Thu 19:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The loneliness Game</title>
<meta name="author" content="Crystal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../src/css/colors.css"/>
<link rel="stylesheet" type="text/css" href="../../src/css/style.css"/>
<link rel="icon" type="image/x-icon" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://crystal.tilde.institute/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">The loneliness Game</h1>
<p>
Hello !!, I hope you are doing great you amazing person whoever you are, and I really appreciate you reading my little C programming adventure. Soo basically I wanted to blog about a little game I made when bored, and figured out it would be a great way to optimize it, and learn new stuff too by documenting the process!
</p>
<div id="outline-container-org26dcb46" class="outline-2">
<h2 id="org26dcb46">The concept :</h2>
<div class="outline-text-2" id="text-org26dcb46">
<p>
Basically the player is faced with a NxM field made up with the sign <b>&ldquo;-&rdquo;</b> and the player is denoted by the symbol <b>&ldquo;+&rdquo;</b>, there are also Bonuses <b>&ldquo;B&rdquo;</b> which add 1 to your score, Traps <b>&ldquo;T&rdquo;</b>, that remove one from your score, and Dead <b>&ldquo;D&rdquo;</b> which resets the score to 0. I will go into more of the specifics later but for now this is how it works, and the controls are Basic WASD bindings, though i may go for a HJKL style later.
</p>
</div>
</div>
