m/crystal/blog/c/game.html
<div id="outline-container-org37eeebf" class="outline-2">
<h2 id="org37eeebf">The code :</h2>
<div class="outline-text-2" id="text-org37eeebf">
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">  1: </span><span style="color: #f9e2af;">#include</span> <span style="color: #f38ba8;">&lt;</span><span style="color: #a6e3a1;">stdio.h</span><span style="color: #f38ba8;">&gt;</span>
<span class="linenr">  2: </span><span style="color: #f9e2af;">#include</span> <span style="color: #f38ba8;">&lt;</span><span style="color: #a6e3a1;">stdlib.h</span><span style="color: #f38ba8;">&gt;</span>
<span class="linenr">  3: </span><span style="color: #f9e2af;">int</span> <span style="color: #89b4fa;">main</span><span style="color: #f38ba8;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">argc</span>, <span style="color: #f9e2af;">char</span> *<span style="color: #cdd6f4;">argv</span><span style="color: #fab387;">[]</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">  4: </span>    <span style="color: #f9e2af;">char</span> <span style="color: #cdd6f4;">input</span>,<span style="color: #cdd6f4;">map</span><span style="color: #fab387;">[</span><span style="color: #fab387;">5</span><span style="color: #fab387;">][</span><span style="color: #fab387;">5</span><span style="color: #fab387;">]</span> = <span style="color: #fab387;">{</span>
<span class="linenr">  5: </span>        <span style="color: #f9e2af;">{</span><span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span><span style="color: #f9e2af;">}</span>,
<span class="linenr">  6: </span>        <span style="color: #f9e2af;">{</span><span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span><span style="color: #f9e2af;">}</span>,
<span class="linenr">  7: </span>        <span style="color: #f9e2af;">{</span><span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span><span style="color: #f9e2af;">}</span>,
<span class="linenr">  8: </span>        <span style="color: #f9e2af;">{</span><span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span><span style="color: #f9e2af;">}</span>,
<span class="linenr">  9: </span>        <span style="color: #f9e2af;">{</span><span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span>, <span style="color: #a6e3a1;">'-'</span><span style="color: #f9e2af;">}</span>
<span class="linenr"> 10: </span>    <span style="color: #fab387;">}</span>;
<span class="linenr"> 11: </span>    <span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">stop</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">i</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">moves</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">score</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">pos</span><span style="color: #fab387;">[</span><span style="color: #fab387;">2</span><span style="color: #fab387;">]</span> = <span style="color: #fab387;">{</span><span style="color: #fab387;">2</span>, <span style="color: #fab387;">2</span><span style="color: #fab387;">}</span>;
<span class="linenr"> 12: </span>    <span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">bonus</span><span style="color: #fab387;">[</span><span style="color: #fab387;">2</span><span style="color: #fab387;">]</span>;
<span class="linenr"> 13: </span>    <span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">trap</span><span style="color: #fab387;">[</span><span style="color: #fab387;">2</span><span style="color: #fab387;">]</span> ;
<span class="linenr"> 14: </span>    <span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">death</span><span style="color: #fab387;">[</span><span style="color: #fab387;">2</span><span style="color: #fab387;">]</span>;
<span class="linenr"> 15: </span>    map<span style="color: #fab387;">[</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'+'</span>;
<span class="linenr"> 16: </span>    <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr"> 17: </span>    bonus<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> = arc4random_uniform<span style="color: #f9e2af;">(</span><span style="color: #fab387;">5</span><span style="color: #f9e2af;">)</span>; bonus<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> = arc4random_uniform<span style="color: #f9e2af;">(</span><span style="color: #fab387;">5</span><span style="color: #f9e2af;">)</span>;
<span class="linenr"> 18: </span>    trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> = arc4random_uniform<span style="color: #f9e2af;">(</span><span style="color: #fab387;">5</span><span style="color: #f9e2af;">)</span>; trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> = arc4random_uniform<span style="color: #f9e2af;">(</span><span style="color: #fab387;">5</span><span style="color: #f9e2af;">)</span>;
<span class="linenr"> 19: </span>    death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> = arc4random_uniform<span style="color: #f9e2af;">(</span><span style="color: #fab387;">5</span><span style="color: #f9e2af;">)</span>; death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> = arc4random_uniform<span style="color: #f9e2af;">(</span><span style="color: #fab387;">5</span><span style="color: #f9e2af;">)</span>;
<span class="linenr"> 20: </span>    <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span><span style="color: #f9e2af;">(</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span><span style="color: #fab387;">)</span>;
<span class="linenr"> 21: </span>    map<span style="color: #fab387;">[</span>bonus<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>bonus<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'B'</span>;
<span class="linenr"> 22: </span>    map<span style="color: #fab387;">[</span>trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'T'</span>;
<span class="linenr"> 23: </span>    map<span style="color: #fab387;">[</span>death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'D'</span>;
<span class="linenr"> 24: </span>    <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr"> 25: </span>    printf<span style="color: #f9e2af;">(</span><span style="color: #a6e3a1;">"Map:\n"</span><span style="color: #f9e2af;">)</span>;
<span class="linenr"> 26: </span>    <span style="color: #cba6f7;">for</span> <span style="color: #f9e2af;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">i</span> = <span style="color: #fab387;">0</span>; i &lt; <span style="color: #fab387;">5</span>; i++<span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 27: </span>        <span style="color: #cba6f7;">for</span> <span style="color: #a6e3a1;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">j</span> = <span style="color: #fab387;">0</span>; j &lt; <span style="color: #fab387;">5</span>; j++<span style="color: #a6e3a1;">)</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 28: </span>            printf<span style="color: #f38ba8;">(</span><span style="color: #a6e3a1;">"%c "</span>, map<span style="color: #fab387;">[</span>i<span style="color: #fab387;">][</span>j<span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 29: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 30: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 31: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr"> 32: </span>    printf<span style="color: #f9e2af;">(</span><span style="color: #a6e3a1;">"Score: %d\n"</span>, score<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 33: </span>    printf<span style="color: #f9e2af;">(</span><span style="color: #a6e3a1;">"Moves: %d\n"</span>, moves<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 34: </span>    printf<span style="color: #f9e2af;">(</span><span style="color: #a6e3a1;">"Enter a direction (w,a,s,d) or c to quit: "</span><span style="color: #f9e2af;">)</span>;
<span class="linenr"> 35: </span>    scanf<span style="color: #f9e2af;">(</span><span style="color: #a6e3a1;">" %c"</span>, &amp;input<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 36: </span><span style="color: #6c7086;">// </span><span style="color: #6c7086;">pos[0] updown pos[1] lr</span>
<span class="linenr"> 37: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>input == <span style="color: #a6e3a1;">'w'</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 38: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"Moving up\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 39: </span>        map<span style="color: #a6e3a1;">[</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">][</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr"> 40: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #a6e3a1;">(</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> == <span style="color: #fab387;">0</span><span style="color: #a6e3a1;">)</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 41: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> = <span style="color: #fab387;">4</span>;
<span class="linenr"> 42: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 43: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 44: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>--;
<span class="linenr"> 45: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 46: </span>    <span style="color: #f9e2af;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>input == <span style="color: #a6e3a1;">'a'</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 47: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"Moving left\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 48: </span>        map<span style="color: #a6e3a1;">[</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">][</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr"> 49: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #a6e3a1;">(</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> == <span style="color: #fab387;">0</span><span style="color: #a6e3a1;">)</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 50: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> = <span style="color: #fab387;">4</span>;
<span class="linenr"> 51: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 52: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 53: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>--;
<span class="linenr"> 54: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 55: </span>    <span style="color: #f9e2af;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>input == <span style="color: #a6e3a1;">'s'</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 56: </span>
<span class="linenr"> 57: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"Moving down\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 58: </span>        map<span style="color: #a6e3a1;">[</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">][</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr"> 59: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #a6e3a1;">(</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> == <span style="color: #fab387;">4</span><span style="color: #a6e3a1;">)</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 60: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> = <span style="color: #fab387;">0</span>;
<span class="linenr"> 61: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 62: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 63: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>++;
<span class="linenr"> 64: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 65: </span>    <span style="color: #f9e2af;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>input == <span style="color: #a6e3a1;">'d'</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 66: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"Moving right\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 67: </span>        map<span style="color: #a6e3a1;">[</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">][</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr"> 68: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #a6e3a1;">(</span>pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> == <span style="color: #fab387;">4</span><span style="color: #a6e3a1;">)</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 69: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> = <span style="color: #fab387;">0</span>;
<span class="linenr"> 70: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 71: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #a6e3a1;">{</span>
<span class="linenr"> 72: </span>            pos<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>++;
<span class="linenr"> 73: </span>        <span style="color: #a6e3a1;">}</span>
<span class="linenr"> 74: </span>    <span style="color: #f9e2af;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>input == <span style="color: #a6e3a1;">'c'</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 75: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"Quitting\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 76: </span>    <span style="color: #f9e2af;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 77: </span>        printf<span style="color: #a6e3a1;">(</span><span style="color: #a6e3a1;">"Invalid input\n"</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 78: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr"> 79: </span>    map<span style="color: #f9e2af;">[</span>pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">][</span>pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">]</span> = <span style="color: #a6e3a1;">'+'</span>;
<span class="linenr"> 80: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 81: </span>        score++;
<span class="linenr"> 82: </span>        <span style="color: #cba6f7;">do</span><span style="color: #a6e3a1;">{</span>
<span class="linenr"> 83: </span>        bonus<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 84: </span>        bonus<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 85: </span>        <span style="color: #a6e3a1;">}</span><span style="color: #cba6f7;">while</span><span style="color: #a6e3a1;">(</span><span style="color: #f38ba8;">(</span>bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 86: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr"> 87: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 88: </span>        score--;
<span class="linenr"> 89: </span>        <span style="color: #cba6f7;">do</span><span style="color: #a6e3a1;">{</span>
<span class="linenr"> 90: </span>        trap<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 91: </span>        trap<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 92: </span>        <span style="color: #a6e3a1;">}</span><span style="color: #cba6f7;">while</span><span style="color: #a6e3a1;">(</span><span style="color: #f38ba8;">(</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr"> 93: </span>        <span style="color: #f9e2af;">}</span>
<span class="linenr"> 94: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr"> 95: </span>        score = <span style="color: #fab387;">0</span>;
<span class="linenr"> 96: </span>        <span style="color: #cba6f7;">do</span><span style="color: #a6e3a1;">{</span>
<span class="linenr"> 97: </span>        death<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 98: </span>        death<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr"> 99: </span>        <span style="color: #a6e3a1;">}</span><span style="color: #cba6f7;">while</span><span style="color: #a6e3a1;">(</span><span style="color: #f38ba8;">(</span>death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr">100: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr">101: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>score % <span style="color: #fab387;">3</span> == <span style="color: #fab387;">0</span> &amp;&amp; score != <span style="color: #fab387;">0</span> &amp;&amp; stop == <span style="color: #fab387;">0</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr">102: </span>        map<span style="color: #a6e3a1;">[</span>death<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">][</span>death<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span><span style="color: #a6e3a1;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">103: </span>        <span style="color: #cba6f7;">do</span><span style="color: #a6e3a1;">{</span>
<span class="linenr">104: </span>        death<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr">105: </span>        death<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr">106: </span>        <span style="color: #a6e3a1;">}</span><span style="color: #cba6f7;">while</span><span style="color: #a6e3a1;">(</span><span style="color: #f38ba8;">(</span>death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr">107: </span>        stop = <span style="color: #fab387;">1</span>;
<span class="linenr">108: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr">109: </span>    <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>score % <span style="color: #fab387;">3</span> != <span style="color: #fab387;">0</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr">110: </span>    stop = <span style="color: #fab387;">0</span>;
<span class="linenr">111: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr">112: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f9e2af;">(</span>moves % <span style="color: #fab387;">5</span> == <span style="color: #fab387;">0</span> &amp;&amp; moves != <span style="color: #fab387;">0</span><span style="color: #f9e2af;">)</span> <span style="color: #f9e2af;">{</span>
<span class="linenr">113: </span>        <span style="color: #cba6f7;">do</span><span style="color: #a6e3a1;">{</span>
<span class="linenr">114: </span>            map<span style="color: #f38ba8;">[</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">][</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">115: </span>        trap<span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr">116: </span>        trap<span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span>= arc4random_uniform<span style="color: #f38ba8;">(</span><span style="color: #fab387;">5</span><span style="color: #f38ba8;">)</span>;
<span class="linenr">117: </span>        <span style="color: #a6e3a1;">}</span><span style="color: #cba6f7;">while</span><span style="color: #a6e3a1;">(</span><span style="color: #f38ba8;">(</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> || <span style="color: #f38ba8;">(</span>trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span><span style="color: #a6e3a1;">)</span>;
<span class="linenr">118: </span>
<span class="linenr">119: </span>    <span style="color: #f9e2af;">}</span>
<span class="linenr">120: </span>    map<span style="color: #f9e2af;">[</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">][</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">]</span> = <span style="color: #a6e3a1;">'B'</span>;
<span class="linenr">121: </span>    map<span style="color: #f9e2af;">[</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">][</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">]</span> = <span style="color: #a6e3a1;">'T'</span>;
<span class="linenr">122: </span>    map<span style="color: #f9e2af;">[</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">][</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">]</span> = <span style="color: #a6e3a1;">'D'</span>;
<span class="linenr">123: </span>    moves++;
<span class="linenr">124: </span>    <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span>input != <span style="color: #a6e3a1;">'c'</span><span style="color: #fab387;">)</span>;
<span class="linenr">125: </span>    <span style="color: #cba6f7;">return</span> <span style="color: #fab387;">0</span>;
<span class="linenr">126: </span><span style="color: #f38ba8;">}</span>
<span class="linenr">127: </span>
</pre>
</div>


<p>
Let&rsquo;s go step by step and see what we can fix or improve, to start off, line 4 to 10 can be reduced to 7 or 8 lines (which will be  beneficial later too)
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 4: </span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">n</span>=<span style="color: #fab387;">5</span>,<span style="color: #cdd6f4;">m</span>=<span style="color: #fab387;">5</span>;
<span class="linenr"> 5: </span><span style="color: #f9e2af;">char</span> <span style="color: #cdd6f4;">input</span>,<span style="color: #cdd6f4;">map</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">50</span><span style="color: #f38ba8;">][</span><span style="color: #fab387;">50</span><span style="color: #f38ba8;">]</span>;
<span class="linenr"> 6: </span>    <span style="color: #cba6f7;">for</span> <span style="color: #f38ba8;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">i</span> = <span style="color: #fab387;">0</span>; i &lt; n; i++<span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr"> 7: </span>        <span style="color: #cba6f7;">for</span> <span style="color: #fab387;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">j</span> = <span style="color: #fab387;">0</span>; j &lt; m; j++<span style="color: #fab387;">)</span> <span style="color: #fab387;">{</span>
<span class="linenr"> 8: </span>            map<span style="color: #f9e2af;">[</span>i<span style="color: #f9e2af;">][</span>j<span style="color: #f9e2af;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr"> 9: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">10: </span>    <span style="color: #f38ba8;">}</span>
<span class="linenr">11: </span>
</pre>
</div>

<p>
For now at least, n and m are hardcoded to 5, but this will change later. And I picked 50x50 as a max size because why not
</p>

<p>
Of course we have the usual inits on line 11, though since we are using variables instead of hardcoding 5, we will have to find the center by ourselves
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">11: </span>    <span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">stop</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">i</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">moves</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">score</span>=<span style="color: #fab387;">0</span>,<span style="color: #cdd6f4;">pos</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">2</span><span style="color: #f38ba8;">]</span> = <span style="color: #f38ba8;">{</span>n/<span style="color: #fab387;">2</span>,m/<span style="color: #fab387;">2</span><span style="color: #f38ba8;">}</span>;
</pre>
</div>

<p>
This is getting better, of course we then initialize the coordinates of bonus, trap, and death, and set the player as a <b>&rsquo;+&rsquo;</b> in the field.
</p>


<p>
Here comes the line 17-21, where it generates a random coordinate for the aforementioned pickups, and do that until there is no conflict between eachother and the player) here we will need to change it a tiny bit.
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">17: </span>    <span style="color: #f9e2af;">bonus</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> = arc4random_uniform<span style="color: #f38ba8;">(</span>n<span style="color: #f38ba8;">)</span>; <span style="color: #f9e2af;">bonus</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> = arc4random_uniform<span style="color: #f38ba8;">(</span>m<span style="color: #f38ba8;">)</span>;
<span class="linenr">18: </span>    <span style="color: #f9e2af;">trap</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> = arc4random_uniform<span style="color: #f38ba8;">(</span>n<span style="color: #f38ba8;">)</span>; <span style="color: #f9e2af;">trap</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> = arc4random_uniform<span style="color: #f38ba8;">(</span>m<span style="color: #f38ba8;">)</span>;
<span class="linenr">19: </span>    <span style="color: #f9e2af;">death</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">0</span><span style="color: #f38ba8;">]</span> = arc4random_uniform<span style="color: #f38ba8;">(</span>n<span style="color: #f38ba8;">)</span>; <span style="color: #f9e2af;">death</span><span style="color: #f38ba8;">[</span><span style="color: #fab387;">1</span><span style="color: #f38ba8;">]</span> = arc4random_uniform<span style="color: #f38ba8;">(</span>m<span style="color: #f38ba8;">)</span>;
</pre>
</div>

<p>
Looking good so far!!, We then have line 21-23 which also shows the pickups as their respective symbols in the map.
</p>


<p>
The main interactive program starts here, which will learn at least one time and stop if the received input is a <b>&rsquo;c&rsquo;</b>, it starts with a nested for loop on line 26 up to 31 to show the content of the map, nothing fancy, just some matrix stuff. we need to change the 5 though!
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">26: </span>  <span style="color: #cba6f7;">for</span> <span style="color: #f38ba8;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">i</span> = <span style="color: #fab387;">0</span>; i &lt; n; i++<span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">27: </span>        <span style="color: #cba6f7;">for</span> <span style="color: #fab387;">(</span><span style="color: #f9e2af;">int</span> <span style="color: #cdd6f4;">j</span> = <span style="color: #fab387;">0</span>; j &lt; m; j++<span style="color: #fab387;">)</span> <span style="color: #fab387;">{</span>
<span class="linenr">28: </span>            printf<span style="color: #f9e2af;">(</span><span style="color: #a6e3a1;">"%c "</span>, map<span style="color: #a6e3a1;">[</span>i<span style="color: #a6e3a1;">][</span>j<span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span>;
<span class="linenr">29: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">30: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">31: </span>    <span style="color: #f38ba8;">}</span>
<span class="linenr">32: </span>
</pre>
</div>
<p>
We show the score and the moves too, which at the start of the game are set to 0. and we prompt the user for a direction. Note here the space before the %c, this basically allows for the program to not choke on newlines and also even if the user writes multiple keys at the same time, they will still be done, like <b>ww</b> will make the player move twice up.
</p>

<p>
After that we have some logic which should also be changed to account for the n and m changes yet again
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">37: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>input == <span style="color: #a6e3a1;">'w'</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">38: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"Moving up\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">39: </span>        map<span style="color: #fab387;">[</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">40: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #fab387;">(</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> == <span style="color: #fab387;">0</span><span style="color: #fab387;">)</span> <span style="color: #fab387;">{</span>
<span class="linenr">41: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> = n-<span style="color: #fab387;">1</span>;
<span class="linenr">42: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">43: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #fab387;">{</span>
<span class="linenr">44: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>--;
<span class="linenr">45: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">46: </span>    <span style="color: #f38ba8;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>input == <span style="color: #a6e3a1;">'a'</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">47: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"Moving left\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">48: </span>        map<span style="color: #fab387;">[</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">49: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #fab387;">(</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> == <span style="color: #fab387;">0</span><span style="color: #fab387;">)</span> <span style="color: #fab387;">{</span>
<span class="linenr">50: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> = m-<span style="color: #fab387;">1</span>;
<span class="linenr">51: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">52: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #fab387;">{</span>
<span class="linenr">53: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>--;
<span class="linenr">54: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">55: </span>    <span style="color: #f38ba8;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>input == <span style="color: #a6e3a1;">'s'</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">56: </span>
<span class="linenr">57: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"Moving down\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">58: </span>        map<span style="color: #fab387;">[</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">59: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #fab387;">(</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> == n-<span style="color: #fab387;">1</span><span style="color: #fab387;">)</span> <span style="color: #fab387;">{</span>
<span class="linenr">60: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span> = <span style="color: #fab387;">0</span>;
<span class="linenr">61: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">62: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #fab387;">{</span>
<span class="linenr">63: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>++;
<span class="linenr">64: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">65: </span>    <span style="color: #f38ba8;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>input == <span style="color: #a6e3a1;">'d'</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">66: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"Moving right\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">67: </span>        map<span style="color: #fab387;">[</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">68: </span>        <span style="color: #cba6f7;">if</span> <span style="color: #fab387;">(</span>pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> == m-<span style="color: #fab387;">1</span><span style="color: #fab387;">)</span> <span style="color: #fab387;">{</span>
<span class="linenr">69: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span> = <span style="color: #fab387;">0</span>;
<span class="linenr">70: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">71: </span>        <span style="color: #cba6f7;">else</span> <span style="color: #fab387;">{</span>
<span class="linenr">72: </span>            pos<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>++;
<span class="linenr">73: </span>        <span style="color: #fab387;">}</span>
<span class="linenr">74: </span>    <span style="color: #f38ba8;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>input == <span style="color: #a6e3a1;">'c'</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">75: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"Quitting\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">76: </span>    <span style="color: #f38ba8;">}</span> <span style="color: #cba6f7;">else</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">77: </span>        printf<span style="color: #fab387;">(</span><span style="color: #a6e3a1;">"Invalid input\n"</span><span style="color: #fab387;">)</span>;
<span class="linenr">78: </span>    <span style="color: #f38ba8;">}</span>
</pre>
</div>

<p>
What this achieves is the &ldquo;teleportation effect&rdquo; whenever you are at the border of the screen!
</p>


<p>
Now we fix things from line 80 to the end of the program, aka replacing ever occurrence of 5 with n or m
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 80: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == bonus<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr"> 81: </span>        score++;
<span class="linenr"> 82: </span>        <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr"> 83: </span>        bonus<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>n<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 84: </span>        bonus<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>m<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 85: </span>        <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span><span style="color: #f9e2af;">(</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span><span style="color: #fab387;">)</span>;
<span class="linenr"> 86: </span>    <span style="color: #f38ba8;">}</span>
<span class="linenr"> 87: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == trap<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr"> 88: </span>        score--;
<span class="linenr"> 89: </span>        <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr"> 90: </span>        trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>n<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 91: </span>        trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>m<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 92: </span>        <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span><span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span><span style="color: #fab387;">)</span>;
<span class="linenr"> 93: </span>        <span style="color: #f38ba8;">}</span>
<span class="linenr"> 94: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>pos<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">0</span><span style="color: #fab387;">]</span> &amp;&amp; pos<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span> == death<span style="color: #fab387;">[</span><span style="color: #fab387;">1</span><span style="color: #fab387;">]</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr"> 95: </span>        score = <span style="color: #fab387;">0</span>;
<span class="linenr"> 96: </span>        <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr"> 97: </span>        death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>n<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 98: </span>        death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>m<span style="color: #f9e2af;">)</span>;
<span class="linenr"> 99: </span>        <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span><span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span><span style="color: #fab387;">)</span>;
<span class="linenr">100: </span>    <span style="color: #f38ba8;">}</span>
<span class="linenr">101: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>score % <span style="color: #fab387;">3</span> == <span style="color: #fab387;">0</span> &amp;&amp; score != <span style="color: #fab387;">0</span> &amp;&amp; stop == <span style="color: #fab387;">0</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">102: </span>        map<span style="color: #fab387;">[</span>death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">][</span>death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span><span style="color: #fab387;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">103: </span>        <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr">104: </span>        death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>n<span style="color: #f9e2af;">)</span>;
<span class="linenr">105: </span>        death<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>m<span style="color: #f9e2af;">)</span>;
<span class="linenr">106: </span>        <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span><span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span><span style="color: #fab387;">)</span>;
<span class="linenr">107: </span>        stop = <span style="color: #fab387;">1</span>;
<span class="linenr">108: </span>    <span style="color: #f38ba8;">}</span>
<span class="linenr">109: </span>    <span style="color: #cba6f7;">else</span> <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>score % <span style="color: #fab387;">3</span> != <span style="color: #fab387;">0</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">110: </span>    stop = <span style="color: #fab387;">0</span>;
<span class="linenr">111: </span>    <span style="color: #f38ba8;">}</span>
<span class="linenr">112: </span>    <span style="color: #cba6f7;">if</span> <span style="color: #f38ba8;">(</span>moves % <span style="color: #fab387;">5</span> == <span style="color: #fab387;">0</span> &amp;&amp; moves != <span style="color: #fab387;">0</span><span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">{</span>
<span class="linenr">113: </span>        <span style="color: #cba6f7;">do</span><span style="color: #fab387;">{</span>
<span class="linenr">114: </span>            map<span style="color: #f9e2af;">[</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">][</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">]</span> = <span style="color: #a6e3a1;">'-'</span>;
<span class="linenr">115: </span>        trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">0</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>n<span style="color: #f9e2af;">)</span>;
<span class="linenr">116: </span>        trap<span style="color: #f9e2af;">[</span><span style="color: #fab387;">1</span><span style="color: #f9e2af;">]</span>= arc4random_uniform<span style="color: #f9e2af;">(</span>m<span style="color: #f9e2af;">)</span>;
<span class="linenr">117: </span>        <span style="color: #fab387;">}</span><span style="color: #cba6f7;">while</span><span style="color: #fab387;">(</span><span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == bonus<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == death<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span> || <span style="color: #f9e2af;">(</span>trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">0</span><span style="color: #a6e3a1;">]</span> &amp;&amp; trap<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span> == pos<span style="color: #a6e3a1;">[</span><span style="color: #fab387;">1</span><span style="color: #a6e3a1;">]</span><span style="color: #f9e2af;">)</span><span style="color: #fab387;">)</span>;
<span class="linenr">118: </span>
<span class="linenr">119: </span>    <span style="color: #f38ba8;">}</span>
</pre>
</div>


<p>
Aaaaand this should be it
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Crystal</p>
<p class="date">Created: 2024-02-22 Thu 19:09</p>
</div>
</body>
</html>
